// 2 차원 배열을 구현해보시오
// 이때 , Shape 은 5x5 구조로 생성 하여 값을 입력하고 출력도 해보시오
// 특정 좌표에는 ★ 을 입력해보시오
/*[결과 출력]
-----------------------------------------------------------------------------------------------------------------------------
□□□□□
□□□□□
□□★□□
□□□□□
□□□□□
-----------------------------------------------------------------------------------------------------------------------------*/
public class License_CosPattern4{
	public static void main(String[] args){
		char[][] ar = {{'□', '□', '□', '□', '□'},   // 작은 따옴표 붙이기
							{'□', '□', '□', '□', '□'},
							{'□', '□', '★', '□', '□'},
							{'□', '□', '□', '□', '□'},
							{'□', '□', '□', '□', '□'}};
		
		for(int i=0; i<ar.length; i++){
			for(int j=0; j<ar.length; j++)
				System.out.print(ar[i][j]);
			System.out.println();
		}
	}
}