// 배열내 숫자들의 각 빈도 수를 출력하는 코드를 구현하시오
// [ 1, 3, 2, 2, 1, 3, 1, 1 ] 각 숫자별 빈도 수는
// 1--> 4 회 , 2 --> 2 회 , 3 -L-> 2 회
/*[결과 출력]
-----------------------------------------------------------------------------------------------------------------------------
0번 숫자 --> 2 번
1번 숫자 --> 3 번
2번 숫자 --> 1 번
3번 숫자 --> 4 번
-------------------------------------------------------------------------------------------------------------------------------*/
public class License_CosPattern1{
	public static void main(String[] args){
		int[] target = {1, 3, 2, 2, 1, 3, 1, 1};
		int[] count = new int[3];
		
		for(int i=0; i<target.length; i++)
			count[target[i]-1]++;
		
		for(int i=0; i<count.length; i++){
			System.out.println((i+1) + " 번 숫자 --> " + count[i] + " 번");
		}
	}
}